# GIT - это распределенная система контроля версий
# Это система для отслеживания и ведения истории изменения файлов в нашем проекте 
# При помощи гит можно организовать командную работу.

# GitHub - это веб-сайт для размещения git-репозитории в совместной разработке проектов.

# Репозиторий - это хранилище нашего кода и истории его изменений 

# git init - создает удаленный репозиторий, в той директории, в которой была прописано команда
# git add . - команда для добавления изменений в систему отслежживание гита. 
# git commit -m 'something' - это команда для сохранения всех изменений с комментарием к ним
# git branch -M main - эта команда переименовывает главную ветку мастер на мэйн
# git remote add origin 'url' - эта команда связывает наш локальный репозиторий с удаленным репозиторием на гитхабе
# git push origin <main> - эта команда отправки наших ихменений на удаленный репозиторий    

# git status
# git branch

